/* Цикл for використовується у випадках, коли ви точно знаєте
скільки разів ви хочете виконати один і той самий код 
for(ініціалізацію внутрішніх змінних, тобто, лічильника; умова продовження циклу,
    поки у мова істинна - цикл йде; пост вираз, у якому будете вказувати як буде змінюватися лічильник)
*/

for (let i = 0; i < 5; i += 1) {
    console.log(i, "Hello world!");
}

for (let i = 10; i > 0; i -= 1) {
    console.log(i, "My name is Andrii");
}

for (let i = 2; i <= 30; i += 2) {
    console.log(i);
}